Revit 2026 API

# RebarCurvesDataCanAddBarGeometry Method

---

If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.

If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanAddBarGeometry()
```
```vb
Public Function CanAddBarGeometry As Boolean
```
```cpp
public:
bool CanAddBarGeometry()
```
```fsharp
member CanAddBarGeometry : unit -> bool
```

#### Return Value

Boolean Returns true if we can add more bar geometry for the current layout, false otherwise.

#### Reference

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace